snlkuharlocal/src/DataProcessors/ВосттановлениеПоследовательностиТовары/ВосттановлениеПоследовательностиТовары.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВосттановлениеПоследовательностиТовары</name>
  <attributes>
    <name>Транзакции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыбГран</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Проводить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьНули</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Последовательность</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДок</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/ЛогиОстатковТМЦ/ЛогиОстатковТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛогиОстатковТМЦ</name>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзменения1</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>допинф</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DelДатаИзменения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Enums/ТипыСообщенийЛога/ТипыСообщенийЛога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСообщенийЛога</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Комплектация/Комплектация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Комплектация</name>
  <comment>Комплектация</comment>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.СпайкиВПути</registerRecords>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияНакладной</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКомплектующих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоРаскомплектация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьПродукцию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоВозвратИМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Комплектующие</name>
    <attributes>
      <name>Продукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидКомплектации</name>
      <type>
        <types>CatalogRef.ВидыКомплектаций</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКомплектующих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/DataProcessors/ВосттановлениеПоследовательностиТовары/ObjectModule.bsl
Процедура Сообщить1(стр) экспорт
	 
	#ЕСЛИ КЛИЕНТ ТОГДА
    Сообщить(стр);
	ЗаписатьВЛог("Проведение документов быстрое",стр,Перечисления.ТипыСообщенийЛога.Информация); 
 	#ИНАЧЕ
	ЗаписатьВЛог("Проведение документов быстрое",стр,Перечисления.ТипыСообщенийЛога.Информация); 
	#КОНЕЦЕСЛИ
    		 
 Конецпроцедуры
 
Процедура СформироватьПоследовательность() Экспорт

	#ЕСЛИ КЛИЕНТ ТОГДА 
	НачДатаИзменения=НачалоДня(ВыбДата);
	ПРОВОДИТЬ=ЛОЖЬ;
	КонДатаЛогов=КонецДня(ТекущаяДата());
    #иначе 
	//Запуск регл. задания в 00:00:02
	НачДатаИзменения=НачалоДня(НачалоДня(ТекущаяДата())-2);
	ПРОВОДИТЬ=истина;
	ТРАНЗАКЦИИ=ЛОЖЬ;
	НЕУЧИТЫВАТЬНУЛИ=ЛОЖЬ;  
	КонДатаЛогов=КонецДня(НачалоДня(ТекущаяДата())-2);
    #КОНЕЦЕСЛИ
	
	
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	             |	МИНИМУМ(ГраницаПоследовательности.ДатаДок) КАК ПравильнаяГраница
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		МИНИМУМ(ЛогиОстатковТМЦ.Документ.Дата) КАК ДатаДок
	             |	ИЗ
	             |		РегистрСведений.ЛогиОстатковТМЦ КАК ЛогиОстатковТМЦ
	             |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	             |			ПО ЛогиОстатковТМЦ.Документ = ОстаткиТМЦ.Регистратор
	             |	ГДЕ
	             |		ЛогиОстатковТМЦ.ДатаИзменения1 МЕЖДУ &НачДатаИзменения И &ДатаИзменения
	             |		И ОстаткиТМЦ.Период ЕСТЬ NULL 
	             |		И ((НЕ ЛогиОстатковТМЦ.Документ ССЫЛКА Документ.ЗаказПоставщику)
	             |				ИЛИ ЛогиОстатковТМЦ.Документ ССЫЛКА Документ.ЗаказПоставщику
	             |					И ЛогиОстатковТМЦ.Документ.ОтгрузкаСТранзитногоСклада = ИСТИНА)";
				 Если НеУчитыватьНули тогда запрос.Текст=запрос.Текст+"	И ЛогиОстатковТМЦ.допинф <> ""Нули""";Конецесли;
			     запрос.Текст=запрос.Текст+" 		 
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		МИНИМУМ(ОстаткиТМЦ.Период)
	             |	ИЗ
	             |		РегистрСведений.ЛогиОстатковТМЦ КАК ЛогиОстатковТМЦ
	             |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	             |			ПО ЛогиОстатковТМЦ.Документ = ОстаткиТМЦ.Регистратор
	             |	ГДЕ
	             |		ЛогиОстатковТМЦ.ДатаИзменения1 МЕЖДУ &НачДатаИзменения И &ДатаИзменения
	             |		И ((НЕ ЛогиОстатковТМЦ.Документ ССЫЛКА Документ.ЗаказПоставщику)
	             |				ИЛИ ЛогиОстатковТМЦ.Документ ССЫЛКА Документ.ЗаказПоставщику
	             |					И ЛогиОстатковТМЦ.Документ.ОтгрузкаСТранзитногоСклада = ИСТИНА)) КАК ГраницаПоследовательности";
				 
				 
                Запрос.УстановитьПараметр("ДатаИзменения",КонДатаЛогов);
				Запрос.УстановитьПараметр("НачДатаИзменения",НачДатаИзменения);
				Сообщить1("Обрабатываем логи за период с "+НачДатаИзменения+ " по "+КонДатаЛогов);
                Выб=Запрос.Выполнить().Выбрать();
				Косяк=Истина;
				Если Выб.Следующий() тогда
					ГраницаПоследовательности=выб.ПравильнаяГраница;
					Если НЕ выб.ПравильнаяГраница=NULL тогда
						Косяк=Ложь;
						ГранКлассич=последовательности.Товары.ПолучитьГраницу().дата;
						сообщить1("Расчетная граница последовательности="+ГраницаПоследовательности+" Граница изменений="+константы.ДатаРасчетнойПоследовательности.Получить()+" Классическая граница="+ГранКлассич);
						ГраницаПоследовательности=Макс(ГраницаПоследовательности,ГранКлассич);
						
						Если НЕ ЗначениеЗаполнено(ВыбГран) тогда
						ВыбГран=Макс(ГраницаПоследовательности,ГранКлассич,константы.ДатаРасчетнойПоследовательности.Получить());
						Конецесли;

					Конецесли;	
				Конецесли;	
												
				Если Косяк тогда
               	#ЕСЛИ КЛИЕНТ ТОГДА
					Предупреждение("Не удалость определить границу для даты изменений=!"+выбдата);
				#ИНАЧЕ
					ЗаписатьВЛог("Проведение документов быстрое","Не удалость определить границу для даты изменений=!"+выбдата,Перечисления.ТипыСообщенийЛога.Информация); 
				#КОНЕЦЕСЛИ
				возврат;
				Конецесли;
    			
				
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЛогиОстатковТМЦ.Документ,
	             |	ЛогиОстатковТМЦ.Документ.Дата КАК ДатаДок
	             |ИЗ
	             |	РегистрСведений.ЛогиОстатковТМЦ КАК ЛогиОстатковТМЦ
	             |ГДЕ
	             |	ЛогиОстатковТМЦ.ДатаИзменения1 МЕЖДУ &НачДатаИзменения И &ДатаИзменения
	             |	И ЛогиОстатковТМЦ.Документ.Дата >= &ГраницаПоследовательности
	             |	И ((НЕ ЛогиОстатковТМЦ.Документ ССЫЛКА Документ.ЗаказПоставщику)
	             |			ИЛИ ЛогиОстатковТМЦ.Документ ССЫЛКА Документ.ЗаказПоставщику
	             |				И ЛогиОстатковТМЦ.Документ.ОтгрузкаСТранзитногоСклада = ИСТИНА)
	             |	И (НЕ ЛогиОстатковТМЦ.Документ ССЫЛКА Документ.Чек)
	             |	И ЛогиОстатковТМЦ.Документ.Проведен = ИСТИНА
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Посл.Регистратор,
	             |	Посл.Регистратор.Дата
	             |ИЗ
	             |	(ВЫБРАТЬ ПЕРВЫЕ 1
	             |		ОстаткиТМЦ.Регистратор КАК Регистратор
	             |	ИЗ
	             |		РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
	             |	ГДЕ
	             |		ОстаткиТМЦ.Период > &МесяцНазад
	             |	
	             |	УПОРЯДОЧИТЬ ПО
	             |		ОстаткиТМЦ.Период УБЫВ) КАК Посл
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДатаДок";
				 
			
				  Запрос.УстановитьПараметр("ДатаИзменения",КонДатаЛогов);
				  Запрос.УстановитьПараметр("НачДатаИзменения",НачДатаИзменения);
				  Запрос.УстановитьПараметр("МесяцНазад",ВыбДата-30*24*60*60);
				  Запрос.УстановитьПараметр("ГраницаПоследовательности",ГраницаПоследовательности);
         		  ТзДокументовПроведенныхЗаднимЧислом=запрос.Выполнить().Выгрузить();
						  
				  
		  МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		  Запрос=новый запрос;
		  Запрос.МенеджерВременныхТаблиц= МенеджерВременныхТаблиц;

		  Запрос.Текст="ВЫБРАТЬ
		               |	з2.Номенклатура,
		               |	МИНИМУМ(НАЧАЛОПЕРИОДА(з2.регистратор.Дата, ДЕНЬ)) КАК Дата
		               |ПОМЕСТИТЬ ТоварыДаты
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		з1.Номенклатура КАК Номенклатура,
		               |		з1.регистратор КАК регистратор
		               |	ИЗ
		               |		(ВЫБРАТЬ
		               |			Док.Номенклатура КАК Номенклатура,
		               |			Док.Ссылка КАК регистратор
		               |		ИЗ
		               |			Документ.РасходнаяНакладная.Товары КАК Док
		               |		ГДЕ
		               |			Док.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			Док.Номенклатура,
		               |			Док.Ссылка
		               |		ИЗ
		               |			Документ.Перемещение.Товары КАК Док
		               |		ГДЕ
		               |			Док.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			Док.Номенклатура,
		               |			Док.Ссылка
		               |		ИЗ
		               |			Документ.Комплектация.Комплектующие КАК Док
		               |		ГДЕ
		               |			Док.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			Док.Номенклатура,
		               |			Док.Ссылка
		               |		ИЗ
		               |			Документ.Инвентаризация.Товары КАК Док
		               |		ГДЕ
		               |			Док.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			Док.Номенклатура,
		               |			Док.Ссылка
		               |		ИЗ
		               |			Документ.ОтчетКассовойСмены.Товары КАК Док
		               |		ГДЕ
		               |			Док.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			Док.Номенклатура,
		               |			Док.Ссылка
		               |		ИЗ
		               |			Документ.РекламационнаяНакладная.Товары КАК Док
		               |		ГДЕ
		               |			Док.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			СписаниеТМЦТовары.Номенклатура,
		               |			СписаниеТМЦТовары.Ссылка
		               |		ИЗ
		               |			Документ.СписаниеТМЦ.Товары КАК СписаниеТМЦТовары
		               |		ГДЕ
		               |			СписаниеТМЦТовары.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			ЗаказПоставщикуТовары.Номенклатура,
		               |			ЗаказПоставщикуТовары.Ссылка
		               |		ИЗ
		               |			Документ.ПриходнаяНакладная.Товары КАК ЗаказПоставщикуТовары
		               |		ГДЕ
		               |			ЗаказПоставщикуТовары.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			ЗаказПоставщикуТовары.Номенклатура,
		               |			ЗаказПоставщикуТовары.Ссылка
		               |		ИЗ
		               |			Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		               |		ГДЕ
		               |			ЗаказПоставщикуТовары.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			ЗаказПоставщикуТовары.Номенклатура,
		               |			ЗаказПоставщикуТовары.Ссылка
		               |		ИЗ
		               |			Документ.ПродажаИМ.Товары КАК ЗаказПоставщикуТовары
		               |		ГДЕ
		               |			ЗаказПоставщикуТовары.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			ПереоценкаТовары.Номенклатура,
		               |			ПереоценкаТовары.Ссылка
		               |		ИЗ
		               |			Документ.Переоценка.Товары КАК ПереоценкаТовары
		               |		ГДЕ
		               |			ПереоценкаТовары.Ссылка.Дата МЕЖДУ &ГраницаПоследовательности И &КонДата) КАК з1
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЛогиОстатковТМЦ КАК логи
		               |			ПО з1.регистратор = логи.Документ
		               |				И (логи.ДатаИзменения1 МЕЖДУ &НачДатаИзменения И &ДатаИзменения)
		               |				И ((НЕ логи.Документ ССЫЛКА Документ.ЗаказПоставщику)
		               |					ИЛИ логи.Документ ССЫЛКА Документ.ЗаказПоставщику
		               |						И логи.Документ.ОтгрузкаСТранзитногоСклада = ИСТИНА)) КАК з2
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	з2.Номенклатура";
		  
		  

 		  Запрос.УстановитьПараметр("ДатаИзменения",КонДатаЛогов);
		  Запрос.УстановитьПараметр("НачДатаИзменения",НачДатаИзменения);
 		  Запрос.УстановитьПараметр("КонДата",НачалоДня(ТекущаяДата())-1);
		  Запрос.УстановитьПараметр("ГраницаПоследовательности",ГраницаПоследовательности);
          Запрос.Выполнить();
				  
				  
		  запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ОстаткиТМЦ.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ товарыдаты КАК тов1
		               |		ПО (тов1.номенклатура = ОстаткиТМЦ.Номенклатура)
		               |			И ОстаткиТМЦ.Регистратор.Дата >= тов1.дата
		               |			И (ОстаткиТМЦ.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход))";
 		   
   		  Выб=Запрос.Выполнить().Выбрать();
	  		  
		  Пока Выб.Следующий() цикл
			  нов=ТзДокументовПроведенныхЗаднимЧислом.Добавить();
			  нов.документ=выб.регистратор;
			  Нов.датадок=выб.регистратор.дата;
		  Конеццикла;	   
		  	
		  
		  //Добавим в последовательность документы за последние дни\день
		  
		  Запрос=новый запрос;
		  запрос.Текст="ВЫБРАТЬ
		               |	РАЗЛИЧНЫЕ ОстаткиТМЦ.Регистратор
		               |ИЗ
		               |	РегистрНакопления.ОстаткиТМЦ КАК ОстаткиТМЦ
		               |ГДЕ
		               |	ОстаткиТМЦ.Регистратор.Дата >= &ПервДата";
					   
		  Запрос.УстановитьПараметр("ПервДата",ВыбГран);
		  Выб=Запрос.Выполнить().Выбрать();
		  
		  КоличествоПоПоследовательности=0;
		  Пока Выб.Следующий() цикл
		 	  нов=ТзДокументовПроведенныхЗаднимЧислом.Добавить();
			  нов.документ=выб.регистратор;
			  Нов.датадок=выб.регистратор.дата; 
			  КоличествоПоПоследовательности=КоличествоПоПоследовательности+1;
		  Конеццикла;	  
		  
		  ТзДокументовПроведенныхЗаднимЧислом.Свернуть("Документ,Датадок");//Могут быть дубли
		  ТзДокументовПроведенныхЗаднимЧислом.Колонки.Добавить("МоментВремени");  
		  
		  // КолДок=0;
      	  для каждого стр из  ТзДокументовПроведенныхЗаднимЧислом цикл
			  Попытка
			  стр.моментвремени=стр.документ.получитьобъект().моментВремени();
		  	  исключение
			  Конецпопытки;
			  
			//  Если ЗначениеЗаполнено(ВыбГран) и выбгран<>'00010101' тогда
			//	  Если стр.Документ.дата<ВыбГран тогда
			//		  продолжить;
			//	  Конецесли;	  
			//  Конецесли;
			//
			//  Если Стр.Документ.Проведен тогда
			//  	КолДок=КолДок+1;
			//  Конецесли;
	  
		Конеццикла;
		
		  ТзДокументовПроведенныхЗаднимЧислом.Сортировать("ДатаДок,МоментВремени");
		  Последовательность.Загрузить(ТзДокументовПроведенныхЗаднимЧислом);
		  			   
		  Сообщить1("Расчетная последовательность:Всего док-тов="+ТзДокументовПроведенныхЗаднимЧислом.количество()+" c учетом границы проведения ВСЕХ ДОКУМЕНТОВ="+Выбгран); 
		  		  
КонецПроцедуры

Процедура сформировать(ТаблицаПараметров = Неопределено) экспорт

	 СформироватьПоследовательность();
	 Если Проводить тогда
	 Провести();
	 Конецесли;
	
КонецПроцедуры

Процедура ПриЗакрытии()
	    ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Ложь;	
		ПараметрыСеанса.ОтключитьКонтрольДЗР		=Ложь;
		ПараметрыСеанса.ОтключитьКонтрольРезервов	=Ложь;	
КонецПроцедуры

Процедура Провести() Экспорт
	
	Если Последовательность.Количество()>0 тогда
		 			  
			  ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Истина;	
			  ПараметрыСеанса.ОтключитьКонтрольДЗР		=Истина;
			  ПараметрыСеанса.ОтключитьКонтрольРезервов	=Истина;	
			  
			    Если Транзакции тогда
			  	НачатьТранзакцию();
		  		Конецесли;
		  
			  ном=0;
			  Стардата=НачалоДня(Последовательность[0].документ.Дата);
			  
			  КолДокЗаПериод=0;
			  Для каждого стр из  Последовательность цикл
				  
				  Док=стр.документ.получитьобъект();
				  
				  //попытка
				  //	ДатаД=Док.дата;
				  //исключение
				  //	продолжить;
				  //КонецПопытки;
				  //
				  //Если ЗначениеЗаполнено(ВыбГран) и выбгран<>'00010101' тогда
				  //	Если ДатаД<ВыбГран тогда
				  //  	  продолжить;
				  //	Конецесли;	  
				  //Конецесли;	
				  
						  
				  #ЕСЛИ КЛИЕНТ ТОГДА
                  ОбработкаПрерыванияПользователя();
			  	  #КОНЕЦЕСЛИ
			  
				  Если НачалоДня(док.дата)=НачалоДня(ТекущаяДата()) тогда
					  прервать;
				  Конецесли;
				  
				  Если Транзакции тогда
					  Если Ном=10 тогда
						  ном=0;
						  Зафиксироватьтранзакцию();
						  НачатьТранзакцию();
					  Конецесли;	  
				  Конецесли;	  	  
				  
				  ном=ном+1;
		
				  Если док.проведен тогда
					  
					  для ном3=1 по 3 цикл
						  Попытка
							  Док.записать(РежимЗаписиДокумента.Проведение);
							  КолДокЗаПериод=КолДокЗаПериод+1;
                  			  прервать;
						  Исключение
						  Конецпопытки;
					  Конеццикла;
					  
					  					  
					  Если ном3=4 тогда
						  сообщить1("Не провелся "+док);
					  Конецесли;
					  
					  //Если док.Метаданные().Имя="ОтчетКассовойСмены" тогда
					  //	сообщить1("Провели "+док);
					  //Конецесли;	
					  
					  Если НачалоДня(док.дата)<>СтарДата тогда
						  Сообщить1("Проведено с "+СтарДата+" по "+док.дата+" документов="+КолДокЗаПериод);
						  КолДокЗаПериод=0;
						  Константы.ДатаРасчетнойПоследовательности.Установить(док.дата);
					  Конецесли;
					  
					  стардата=НачалоДня(док.дата);
				  Конецесли;
				  
			  Конеццикла;	
			  
			  Сообщить1("Проведено с "+СтарДата+" по "+док.дата+" документов="+КолДокЗаПериод);

			  Если Транзакции тогда
			  Зафиксироватьтранзакцию();
			  Конецесли;
			  
			  Константы.ДатаРасчетнойПоследовательности.Установить(ТекущаяДата()); //Со временем окончания проведения
			  ПараметрыСеанса.ОтключитьЖурнализациюЗаписи	=Ложь;	
			  ПараметрыСеанса.ОтключитьКонтрольДЗР		=Ложь;
			  ПараметрыСеанса.ОтключитьКонтрольРезервов	=Ложь;	

	Конецесли;
	
Конецпроцедуры
